luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxEth_regdef.h
/** \brief  Register 112 - Receive Frame Count for Good and Bad 1,024 to Maxsize
 * Bytes Frames */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RX_1024TOMAXOCTETS_FRAMES_GOOD_BAD_Bits B;  /**< \brief Bitfield access */
} Ifx_ETH_RX_1024TOMAXOCTETS_FRAMES_GOOD_BAD;

/** \brief  Register 109 - Receive Frame Count for Good and Bad 128 to 255 Bytes
 * Frames */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RX_128TO255OCTETS_FRAMES_GOOD_BAD_Bits B;   /**< \brief Bitfield access */
} Ifx_ETH_RX_128TO255OCTETS_FRAMES_GOOD_BAD;

/** \brief  Register 110 - Receive Frame Count for Good and Bad 256 to 511 Bytes
 * Frames */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RX_256TO511OCTETS_FRAMES_GOOD_BAD_Bits B;   /**< \brief Bitfield access */
} Ifx_ETH_RX_256TO511OCTETS_FRAMES_GOOD_BAD;

/** \brief  Register 111 - Receive Frame Count for Good and Bad 512 to 1,023
 * Bytes Frames */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RX_512TO1023OCTETS_FRAMES_GOOD_BAD_Bits B;  /**< \brief Bitfield access */
} Ifx_ETH_RX_512TO1023OCTETS_FRAMES_GOOD_BAD;

/** \brief  Register 107 - Receive Frame Count for Good and Bad 64 Byte Frames */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RX_64OCTETS_FRAMES_GOOD_BAD_Bits B; /**< \brief Bitfield access */
} Ifx_ETH_RX_64OCTETS_FRAMES_GOOD_BAD;

/** \brief  Register 108 - Receive Frame Count for Good and Bad 65 to 127 Bytes
 * Frames */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RX_65TO127OCTETS_FRAMES_GOOD_BAD_Bits B;    /**< \brief Bitfield access */
} Ifx_ETH_RX_65TO127OCTETS_FRAMES_GOOD_BAD;

/** \brief  Register 102 - Receive Frame Count for Alignment Error Frames */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RX_ALIGNMENT_ERROR_FRAMES_Bits B;   /**< \brief Bitfield access */
} Ifx_ETH_RX_ALIGNMENT_ERROR_FRAMES;

/** \brief  Register 99 - Receive Frame Count for Good Broadcast Frames */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RX_BROADCAST_FRAMES_GOOD_Bits B;    /**< \brief Bitfield access */
} Ifx_ETH_RX_BROADCAST_FRAMES_GOOD;

/** \brief  Register 121 - Receive Frame Count for Good Control Frames Frames */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RX_CONTROL_FRAMES_GOOD_Bits B;  /**< \brief Bitfield access */
} Ifx_ETH_RX_CONTROL_FRAMES_GOOD;

/** \brief  Register 101 - Receive Frame Count for CRC Error Frames */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RX_CRC_ERROR_FRAMES_Bits B;     /**< \brief Bitfield access */
} Ifx_ETH_RX_CRC_ERROR_FRAMES;

/** \brief  Register 117 - Receive Frame Count for FIFO Overflow Frames */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RX_FIFO_OVERFLOW_FRAMES_Bits B; /**< \brief Bitfield access */
} Ifx_ETH_RX_FIFO_OVERFLOW_FRAMES;

/** \brief  Register 96 - Receive Frame Count for Good and Bad Frames */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RX_FRAMES_COUNT_GOOD_BAD_Bits B;    /**< \brief Bitfield access */
} Ifx_ETH_RX_FRAMES_COUNT_GOOD_BAD;

/** \brief  Register 104 - Receive Frame Count for Jabber Error Frames */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RX_JABBER_ERROR_FRAMES_Bits B;  /**< \brief Bitfield access */
} Ifx_ETH_RX_JABBER_ERROR_FRAMES;

/** \brief  Register 114 - Receive Frame Count for Length Error Frames */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RX_LENGTH_ERROR_FRAMES_Bits B;  /**< \brief Bitfield access */
} Ifx_ETH_RX_LENGTH_ERROR_FRAMES;

/** \brief  Register 100 - Receive Frame Count for Good Multicast Frames */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RX_MULTICAST_FRAMES_GOOD_Bits B;    /**< \brief Bitfield access */
} Ifx_ETH_RX_MULTICAST_FRAMES_GOOD;

/** \brief  Register 98 - Receive Octet Count for Good Frames */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RX_OCTET_COUNT_GOOD_Bits B;     /**< \brief Bitfield access */
} Ifx_ETH_RX_OCTET_COUNT_GOOD;

/** \brief  Register 97 - Receive Octet Count for Good and Bad Frames */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RX_OCTET_COUNT_GOOD_BAD_Bits B; /**< \brief Bitfield access */
} Ifx_ETH_RX_OCTET_COUNT_GOOD_BAD;

/** \brief  Register 115 - Receive Frame Count for Out of Range Frames */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RX_OUT_OF_RANGE_TYPE_FRAMES_Bits B; /**< \brief Bitfield access */
} Ifx_ETH_RX_OUT_OF_RANGE_TYPE_FRAMES;

/** \brief  Register 106 - Receive Frame Count for Oversize Frames */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RX_OVERSIZE_FRAMES_GOOD_Bits B; /**< \brief Bitfield access */
} Ifx_ETH_RX_OVERSIZE_FRAMES_GOOD;

/** \brief  Register 116 - Receive Frame Count for PAUSE Frames */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RX_PAUSE_FRAMES_Bits B;         /**< \brief Bitfield access */
} Ifx_ETH_RX_PAUSE_FRAMES;

/** \brief  Register 120 - Receive Frame Count for Receive Error Frames */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_RX_RECEIVE_ERROR_FRAMES_Bits B; /**< \brief Bitfield access */
} Ifx_ETH_RX_RECEIVE_ERROR_FRAMES;

