luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxEth_regdef.h
/** \brief  Register 456 - Target Time Nanoseconds Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_TARGET_TIME_NANOSECONDS_Bits B; /**< \brief Bitfield access */
} Ifx_ETH_TARGET_TIME_NANOSECONDS;

/** \brief  Register 455 - Target Time Seconds Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_TARGET_TIME_SECONDS_Bits B;     /**< \brief Bitfield access */
} Ifx_ETH_TARGET_TIME_SECONDS;

/** \brief  Register 454 - Timestamp Addend Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_TIMESTAMP_ADDEND_Bits B;        /**< \brief Bitfield access */
} Ifx_ETH_TIMESTAMP_ADDEND;

/** \brief  Register 448 - Timestamp Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_TIMESTAMP_CONTROL_Bits B;       /**< \brief Bitfield access */
} Ifx_ETH_TIMESTAMP_CONTROL;

/** \brief  Register 458 - Timestamp Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_TIMESTAMP_STATUS_Bits B;        /**< \brief Bitfield access */
} Ifx_ETH_TIMESTAMP_STATUS;

/** \brief  Register 4 - Transmit Descriptor List Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_TRANSMIT_DESCRIPTOR_LIST_ADDRESS_Bits B;    /**< \brief Bitfield access */
} Ifx_ETH_TRANSMIT_DESCRIPTOR_LIST_ADDRESS;

/** \brief  Register 1 - Transmit Poll Demand Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_TRANSMIT_POLL_DEMAND_Bits B;    /**< \brief Bitfield access */
} Ifx_ETH_TRANSMIT_POLL_DEMAND;

/** \brief  Register 78 - Transmit Octet Count for Good and Bad 1024 to Maxsize
 * Bytes Frames */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_TX_1024TOMAXOCTETS_FRAMES_GOOD_BAD_Bits B;  /**< \brief Bitfield access */
} Ifx_ETH_TX_1024TOMAXOCTETS_FRAMES_GOOD_BAD;

/** \brief  Register 75 - Transmit Octet Count for Good and Bad 128 to 255 Bytes
 * Frames */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_TX_128TO255OCTETS_FRAMES_GOOD_BAD_Bits B;   /**< \brief Bitfield access */
} Ifx_ETH_TX_128TO255OCTETS_FRAMES_GOOD_BAD;

/** \brief  Register 76 - Transmit Octet Count for Good and Bad 256 to 511 Bytes
 * Frames */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_TX_256TO511OCTETS_FRAMES_GOOD_BAD_Bits B;   /**< \brief Bitfield access */
} Ifx_ETH_TX_256TO511OCTETS_FRAMES_GOOD_BAD;

/** \brief  Register 77 - Transmit Octet Count for Good and Bad 512 to 1023
 * Bytes Frames */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_TX_512TO1023OCTETS_FRAMES_GOOD_BAD_Bits B;  /**< \brief Bitfield access */
} Ifx_ETH_TX_512TO1023OCTETS_FRAMES_GOOD_BAD;

/** \brief  Register 73 - Transmit Octet Count for Good and Bad 64 Byte Frames */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_TX_64OCTETS_FRAMES_GOOD_BAD_Bits B; /**< \brief Bitfield access */
} Ifx_ETH_TX_64OCTETS_FRAMES_GOOD_BAD;

/** \brief  Register 74 - Transmit Octet Count for Good and Bad 65 to 127 Bytes
 * Frames */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_TX_65TO127OCTETS_FRAMES_GOOD_BAD_Bits B;    /**< \brief Bitfield access */
} Ifx_ETH_TX_65TO127OCTETS_FRAMES_GOOD_BAD;

/** \brief  Register 71 - Transmit Frame Count for Good Broadcast Frames */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_TX_BROADCAST_FRAMES_GOOD_Bits B;    /**< \brief Bitfield access */
} Ifx_ETH_TX_BROADCAST_FRAMES_GOOD;

/** \brief  Register 81 - Transmit Frame Count for Good and Bad Broadcast Frames */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_TX_BROADCAST_FRAMES_GOOD_BAD_Bits B;    /**< \brief Bitfield access */
} Ifx_ETH_TX_BROADCAST_FRAMES_GOOD_BAD;

/** \brief  Register 88 - Transmit Frame Count for Carrier Sense Error Frames */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_TX_CARRIER_ERROR_FRAMES_Bits B; /**< \brief Bitfield access */
} Ifx_ETH_TX_CARRIER_ERROR_FRAMES;

/** \brief  Register 85 - Transmit Frame Count for Deferred Frames */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_TX_DEFERRED_FRAMES_Bits B;      /**< \brief Bitfield access */
} Ifx_ETH_TX_DEFERRED_FRAMES;

/** \brief  Register 87 - Transmit Frame Count for Excessive Collision Error
 * Frames */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_TX_EXCESSIVE_COLLISION_FRAMES_Bits B;   /**< \brief Bitfield access */
} Ifx_ETH_TX_EXCESSIVE_COLLISION_FRAMES;

/** \brief  Register 91 - Transmit Frame Count for Excessive Deferral Error
 * Frames */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_TX_EXCESSIVE_DEFERRAL_ERROR_Bits B; /**< \brief Bitfield access */
} Ifx_ETH_TX_EXCESSIVE_DEFERRAL_ERROR;

/** \brief  Register 90 - Transmit Frame Count for Good Frames */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_TX_FRAME_COUNT_GOOD_Bits B;     /**< \brief Bitfield access */
} Ifx_ETH_TX_FRAME_COUNT_GOOD;

/** \brief  Register 70 - Transmit Frame Count for Good and Bad Frames */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_TX_FRAME_COUNT_GOOD_BAD_Bits B; /**< \brief Bitfield access */
} Ifx_ETH_TX_FRAME_COUNT_GOOD_BAD;

/** \brief  Register 86 - Transmit Frame Count for Late Collision Error Frames */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_TX_LATE_COLLISION_FRAMES_Bits B;    /**< \brief Bitfield access */
} Ifx_ETH_TX_LATE_COLLISION_FRAMES;

/** \brief  Register 72 - Transmit Frame Count for Good Multicast Frames */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ETH_TX_MULTICAST_FRAMES_GOOD_Bits B;    /**< \brief Bitfield access */
} Ifx_ETH_TX_MULTICAST_FRAMES_GOOD;

